In [8]:
import pandas as pd
pd.set_option('display.max_columns', 10)
print("Original data set from Excelfile:\n")

Original data set from Excelfile:

      NAME  ROLL NO.  SUB 1  SUB 2  SUB 3  SUB 4  SUB 5  TOTAL
0     Kinn       101     90     79     88     96     95    448
1  Porsche       102     86     98     68     76     82    410
2    Vegas       103     56     78     89     90    100    413
3     Pete       104     89     56     79     69     97    390
4  Sarawat       105     43     45     65     76     87    316
5     Tine       106     67     88     97     67     43    362
6     Fort       107     49     71     69     58     42    289
7     Rain       108     57     78     40     93     91    359
8      Sky       109     50     68     94     83     71    366
9     Payu       110     69     49     75     93     89    375

In [14]:
f=df['NAME'].str.strip()
f.to_excel("D:\sampIe22.xlsx") 
f

0       Kinn
1    Porsche
2      Vegas
3       Pete
4    Sarawat
5       Tine
6       Fort
7       Rain
8        Sky
9       Payu
Name: NAME, dtype: object

In [47]:
print("\nReplace value with Forward:\n")
df=df.reindex([0,'a',1,'b',2,'c',3,'d',4,'e',5,'f'])C                          
k=df.fillna(method='pad')
print(k)

Replace value with Forward:

      NAME  ROLL NO.  SUB 1  SUB 2  SUB 3  SUB 4  SUB 5  TOTAL
0     Kinn     101.0   90.0   79.0   88.0   96.0   95.0  448.0
a     Kinn     101.0   90.0   79.0   88.0   96.0   95.0  448.0
1  Porsche     102.0   86.0   98.0   68.0   76.0   82.0  410.0
b  Porsche     102.0   86.0   98.0   68.0   76.0   82.0  410.0
2    Vegas     103.0   56.0   78.0   89.0   90.0  100.0  413.0
c    Vegas     103.0   56.0   78.0   89.0   90.0  100.0  413.0
3     Pete     104.0   89.0   56.0   79.0   69.0   97.0  390.0
d     Pete     104.0   89.0   56.0   79.0   69.0   97.0  390.0
4  Sarawat     105.0   43.0   45.0   65.0   76.0   87.0  316.0
e  Sarawat     105.0   43.0   45.0   65.0   76.0   87.0  316.0
5     Tine     106.0   67.0   88.0   97.0   67.0   43.0  362.0
f     Tine     106.0   67.0   88.0   97.0   67.0   43.0  362.0

In [48]:
print("\nThe above updated data set will be stored in sampIe2.xlsx file\n")
k.to_excel("d:\sampIe2.xlsx")
print("\n Drop one particular column and its values : \n")
k.drop(['TOTAL'],axis=1, inplace=True)
print(k)

The above updated data set will be stored in sampIe2.xlsx file


 Drop one particular column and its values :

      NAME  ROLL NO.  SUB 1  SUB 2  SUB 3  SUB 4  SUB 5
0     Kinn     101.0   90.0   79.0   88.0   96.0   95.0
a     Kinn     101.0   90.0   79.0   88.0   96.0   95.0
1  Porsche     102.0   86.0   98.0   68.0   76.0   82.0
b  Porsche     102.0   86.0   98.0   68.0   76.0   82.0
2    Vegas     103.0   56.0   78.0   89.0   90.0  100.0
c    Vegas     103.0   56.0   78.0   89.0   90.0  100.0
3     Pete     104.0   89.0   56.0   79.0   69.0   97.0
d     Pete     104.0   89.0   56.0   79.0   69.0   97.0
4  Sarawat     105.0   43.0   45.0   65.0   76.0   87.0
e  Sarawat     105.0   43.0   45.0   65.0   76.0   87.0
5     Tine     106.0   67.0   88.0   97.0   67.0   43.0
f     Tine     106.0   67.0   88.0   97.0   67.0   43.0

In [22]:
print("\nThe above ripdatecl data set will be stored in sampIe3.xlsx file \n ")
k.to_excel("d:\sampIe2.xlsx")
print("\nDrop NaN rows:\n")
df=pd.read_excel("load 82 excel.xlsx")
df=df.reindex([0,'a',1,'b',2,'c',3,'d',4,'e',5,'f'])
print(df)

The above ripdatecl data set will be stored in sampIe3.xlsx file


Drop NaN rows:

      NAME  ROLL NO.  SUB 1  SUB 2  SUB 3  SUB 4  SUB 5  TOTAL
0     Kinn     101.0   90.0   79.0   88.0   96.0   95.0  448.0
a      NaN       NaN    NaN    NaN    NaN    NaN    NaN    NaN
1  Porsche     102.0   86.0   98.0   68.0   76.0   82.0  410.0
b      NaN       NaN    NaN    NaN    NaN    NaN    NaN    NaN
2    Vegas     103.0   56.0   78.0   89.0   90.0  100.0  413.0
c      NaN       NaN    NaN    NaN    NaN    NaN    NaN    NaN
3     Pete     104.0   89.0   56.0   79.0   69.0   97.0  390.0
d      NaN       NaN    NaN    NaN    NaN    NaN    NaN    NaN
4  Sarawat     105.0   43.0   45.0   65.0   76.0   87.0  316.0
e      NaN       NaN    NaN    NaN    NaN    NaN    NaN    NaN
5     Tine     106.0   67.0   88.0   97.0   67.0   43.0  362.0
f      NaN       NaN    NaN    NaN    NaN    NaN    NaN    NaN

In [23]:
x=df.dropna()
print(x)
print("\nThe above updated data set will be stored in sampleS.xlsx file. \n")
x.to_excel("d:\sample5.xlsx")
print("\nRepIace values:\n")

      NAME  ROLL NO.  SUB 1  SUB 2  SUB 3  SUB 4  SUB 5  TOTAL
0     Kinn     101.0   90.0   79.0   88.0   96.0   95.0  448.0
1  Porsche     102.0   86.0   98.0   68.0   76.0   82.0  410.0
2    Vegas     103.0   56.0   78.0   89.0   90.0  100.0  413.0
3     Pete     104.0   89.0   56.0   79.0   69.0   97.0  390.0
4  Sarawat     105.0   43.0   45.0   65.0   76.0   87.0  316.0
5     Tine     106.0   67.0   88.0   97.0   67.0   43.0  362.0

The above updated data set will be stored in sampleS.xlsx file.


RepIace values:

In [24]:
n=pd.read_excel("load 82 excel.xlsx")
print("Original data set:\n") 
print(n)

Original data set:

      NAME  ROLL NO.  SUB 1  SUB 2  SUB 3  SUB 4  SUB 5  TOTAL
0     Kinn       101     90     79     88     96     95    448
1  Porsche       102     86     98     68     76     82    410
2    Vegas       103     56     78     89     90    100    413
3     Pete       104     89     56     79     69     97    390
4  Sarawat       105     43     45     65     76     87    316
5     Tine       106     67     88     97     67     43    362
6     Fort       107     49     71     69     58     42    289
7     Rain       108     57     78     40     93     91    359
8      Sky       109     50     68     94     83     71    366
9     Payu       110     69     49     75     93     89    375

In [27]:
y=n.replace({49:0})
print("\nUpdated dataset with replaced values: (49:SO)\n")
print(y)
print("\nThe above updated data set will be stored in sampIe6.x1sx file. \n")

Updated dataset with replaced values: (49:SO)

      NAME  ROLL NO.  SUB 1  SUB 2  SUB 3  SUB 4  SUB 5  TOTAL
0     Kinn       101     90     79     88     96     95    448
1  Porsche       102     86     98     68     76     82    410
2    Vegas       103     56     78     89     90    100    413
3     Pete       104     89     56     79     69     97    390
4  Sarawat       105     43     45     65     76     87    316
5     Tine       106     67     88     97     67     43    362
6     Fort       107      0     71     69     58     42    289
7     Rain       108     57     78     40     93     91    359
8      Sky       109     50     68     94     83     71    366
9     Payu       110     69      0     75     93     89    375

The above updated data set will be stored in sampIe6.x1sx file.

In [32]:
y.to_excel("d:\sampIe6.xlsx")
print("Original data set from Excelfile:\n")
df=pd.read_excel("load 82 excel.xlsx") 
print(df)

Original data set from Excelfile:

      NAME  ROLL NO.  SUB 1  SUB 2  SUB 3  SUB 4  SUB 5  TOTAL
0     Kinn       101     90     79     88     96     95    448
1  Porsche       102     86     98     68     76     82    410
2    Vegas       103     56     78     89     90    100    413
3     Pete       104     89     56     79     69     97    390
4  Sarawat       105     43     45     65     76     87    316
5     Tine       106     67     88     97     67     43    362
6     Fort       107     49     71     69     58     42    289
7     Rain       108     57     78     40     93     91    359
8      Sky       109     50     68     94     83     71    366
9     Payu       110     69     49     75     93     89    375

In [35]:
print("\nExtract the particular record based on the isin() function condition:\n")
new=df['SUB 2'].isin({49})
print(df[new])

Extract the particular record based on the isin() function condition:

   NAME  ROLL NO.  SUB 1  SUB 2  SUB 3  SUB 4  SUB 5  TOTAL
9  Payu       110     69     49     75     93     89    375